Repository: python-tap/tappy
Catalog: tap/locale/*/LC_MESSAGES/tappy.po
Languages: es, fr, it

source: A TAP consumer for Python
es: Un consumidor TAP para Python
fr: Un consommateur de TAP pour Python
it: Un consumatore TAP per Python

source: A file containing TAP output. Any directories listed will be scanned for files to include as TAP files.
es: Una salida de TAP archivo que contiene. Cualquier directorios listados serán analizados en busca de archivos que incluyen como archivos TAP.
fr: Une sortie TAP de fichier contenant. Tous les répertoires listés seront analysés pour les fichiers à inclure en tant que fichiers TAP.
it: Un file contenente uscita TAP. Ogni directory elencate verranno esaminati per i file da includere come file TAP.

source: use verbose messages
es: utilizar mensajes detallados
fr: utiliser des messages verbeux
it: utilizzare messaggi dettagliati

source: It is an error to explicitly specify any version lower than 13.
es: Es un error especificar explícitamente cualquier versión inferior a 13.
fr: Il ya une erreur de spécifier explicitement une version inférieure à 13.
it: E 'un errore specificare esplicitamente qualsiasi versione inferiore a 13.

source: Stream TAP output instead of the default test runner output.
fr: Sortie TAP Stream lieu de la sortie de lanceur de test par défaut.
it: Flusso uscita TAP invece dell'uscita test runner di default.

source: An optional output directory to write TAP files to. If the directory does not exist, it will be created.
es: Un directorio de salida opcional para escribir archivos TAP a. Si el directorio no existe, se creará.
fr: Un répertoire option de sortie à écrire des fichiers TAP à. Si le répertoire est inexistant, il sera créé.
it: Una directory di output opzionale per scrivere file TAP a. Se la directory non esiste, verrà creata.

source: Store all TAP test results into a combined output file.
es: Guarde todos los resultados de las pruebas de TAP en un archivo de salida combinada.
fr: Conservez tous les résultats des tests de TAP dans un fichier de sortie combiné.
it: Conservare tutti i risultati dei test TAP in un file di output combinato.

source: An optional format string for the TAP output. The format options are: {short_description} for the short description, and {method_name} for the test method name.
es: Una cadena de formato opcional para la salida de TAP. Las opciones de formato son: {short_description} para la descripción corta, y {method_name} para el nombre de método de ensayo.
fr: Une chaîne de format en option pour la sortie de TAP. Les options de format sont: {short_description} pour la courte description, et {method_name} pour le nom de la méthode d'essai.
it: Una stringa di formato opzionale per l'uscita TAP. Le opzioni di formato sono: {short_description} per la breve descrizione, e {method_name} per il nome del metodo di prova.

source: Bad format string: {format} Replacement options are: {{short_description}} and {{method_name}}
es: Cadena de formato Malo: {format} Las opciones de reemplazo son: {{short_description}} y {{method_name}}
fr: Bad chaîne de format: {format} Les options de remplacement sont: {{short_description}} et {{method_name}}
it: Stringa di formato Bad: {format} Le opzioni di sostituzione sono: {{short_description}} e {{method_name}}

source: Multiple version lines appeared.
es: Múltiples líneas de versión aparecieron.
fr: Plusieurs lignes de version sont apparus.
it: Diverse linee di versione è apparso.

source: The version must be on the first line.
es: La versión debe estar en la primera línea.
fr: La version doit être sur la première ligne.
it: La versione deve essere sulla prima riga.

source: Missing a plan.
es: Falta un plan.
fr: Manquer un plan.
it: Manca un piano.

source: Only one plan line is permitted per file.
es: Sólo una línea de plan está permitido por archivo.
fr: Seule une ligne de plan est autorisé par fichier.
it: Solo una riga piano è consentito per file.

source: A plan must appear at the beginning or end of the file.
es: Un plan debe aparecer al principio o al final del archivo.
fr: Un plan doit apparaître au début ou à la fin du fichier.
it: Un piano deve apparire all'inizio o alla fine del file.

source: Expected {expected_count} tests but only {seen_count} ran.
es: Esperados {expected_count} pruebas, pero sólo {seen_count} corrían.
fr: {expected_count} Attendus essais mais seulement {seen_count} ran.
it: Attesi test {expected_count} ma solo {seen_count} ran.

source: Bailed: {reason}
es: Rescatados: {reason}
fr: Renflouées: {reason}

source: {filename} does not exist.
es: {filename} no existe.
fr: {filename} ne pas exister.
it: {filename} non esiste.

source: (expected failure)
es: (fallo esperado)
fr: (échec attendu)
it: (fallimento atteso)

source: (unexpected success)
es: (éxito inesperado)
fr: (succès inattendu)
it: (successo inaspettato)

source: # TAP results for {test_case}
es: # Resultados TAP para {test_case}
fr: # Résultats TAP pour {test_case}
it: # Risultati TAP per {test_case}
